<?php

namespace addons\alioss\controller;

// +----------------------------------------------------------------------
// | EasyAdmin
// +----------------------------------------------------------------------
// | PHP交流群: 763822524
// +----------------------------------------------------------------------
// | 开源协议  https://mit-license.org 
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/zhongshaofa/EasyAdmin
// +----------------------------------------------------------------------

use EasyAddons\Controller;

class Test extends Controller
{

    public function index()
    {
        echo __METHOD__;
    }

}