<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------


return [
    // 缓存配置为复合类型
    'type'    => 'complex',
    'file'    => [
        // 驱动方式
        'type'   => 'file',
        // 缓存保存目录
        'path'   => '../runtime/cache/',
        // 缓存前缀
        'prefix' => '99php_cache_',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],
    'default' => [
        // 驱动方式
        'type'   => 'redis',
        // 缓存保存目录
        'host'   => '127.0.0.1',
        // 缓存前缀
        'prefix' => '99php_cache_',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],
];
