<?php

// +----------------------------------------------------------------------
// | EasyAdmin
// +----------------------------------------------------------------------
// | PHP交流群: 763822524
// +----------------------------------------------------------------------
// | 开源协议  https://mit-license.org 
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/zhongshaofa/EasyAdmin
// +----------------------------------------------------------------------

namespace app\common\constants;

/**
 * 菜单常量
 * Class MenuConstant
 * @package app\common\constants
 */
class MenuConstant
{

    /**
     * 首页的PID
     */
    const HOME_PID = 99999999;

    /**
     * 模块名前缀
     */
    const MODULE_PREFIX = 'easyadmin_';

}